# StairsLandingtypeLandingMaterial Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsLandingtypeLandingMaterial Property
ParameterTypeId Class See Also
---
"Monolithic Material": Landing Material
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsLandingtypeLandingMaterial { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsLandingtypeLandingMaterial As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsLandingtypeLandingMaterial {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace